/*********************************************************
 * config.h - файл, в котором надо заменить значения CPE 
 	для вашей машины для наивных реализаций
 	оптимизируемых функций 
 *********************************************************/
#ifndef _CONFIG_H_
#define _CONFIG_H_

/* 
 * Заполните значеними CPE для базовой (наивной) версии функции
 * поворота изображения на вашей машине.
 * Запустите ./driver, чтобы получить приведенные значения и 
 * впишите вместо предложенных.
 */
#define R64    1.4
#define R128   1.5
#define R256   3.7
#define R512   5.6
#define R1024  6.3

/* 
 * Заполните значеними CPE для базовой (наивной) версии функции
 * сглаживания изображения на вашей машине.
 * Запустите ./driver, чтобы получить приведенные значения и 
 * впишите вместо предложенных.
 */
#define S32   39.6
#define S64   42.1
#define S128  42.3
#define S256  42.4
#define S512  42.9


#endif /* _CONFIG_H_ */
